nxp-mcuxpresso/mcuxsdk-examples/_boards/imx943evk/ecat_examples/digital_io/cm7_core1/pin_mux.c
/*
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT1189xxxxx
package_id: MIMXRT1189CVM8B
mcu_data: ksdk2_0
processor_version: 0.15.9
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

// #include "fsl_common.h"
// #include "fsl_iomuxc.h"
#include "pin_mux.h"

void BOARD_InitI2C6Pins(void) {                                /*!< Function assigned for the core: undefined[cm33] */
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO28__LPI2C6_SCL, 1U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO29__LPI2C6_SDA, 1U);

    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO28__LPI2C6_SCL,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO29__LPI2C6_SDA,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_OD_MASK);
}

void BOARD_InitGPIOPins(void) 
{
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO31__GPIO2_IO31, 0U);

    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO31__GPIO2_IO31,
                        IOMUXC_PAD_DSE(15U) |
                        IOMUXC_PAD_FSEL1(2U) |
                        IOMUXC_PAD_PD_MASK);
}

void BOARD_InitEcatResetPins(void) 
{
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH4_TX_CTL__ECAT_RESET_OUT, 0U);

    IOMUXC_SetPinConfig(IOMUXC_PAD_ETH4_TX_CTL__ECAT_RESET_OUT,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(3));
}

void BOARD_InitEcatLinkPins(void)
{
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_CRS__ECAT_LINK0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_COL__ECAT_LINK1, 0);
    IOMUXC_SetPinConfig(IOMUXC_PAD_ETH0_CRS__ECAT_LINK0,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(3));
    IOMUXC_SetPinConfig(IOMUXC_PAD_ETH0_COL__ECAT_LINK1,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(3));

}

void BOARD_InitEcatMDIOPins(void)
{
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH4_MDIO_GPIO2__ECAT_MDIO, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH4_MDC_GPIO1__ECAT_MDC, 0U);  
    IOMUXC_SetPinConfig(IOMUXC_PAD_ETH4_MDIO_GPIO2__ECAT_MDIO,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(3));
    IOMUXC_SetPinConfig(IOMUXC_PAD_ETH4_MDC_GPIO1__ECAT_MDC,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(3));            
}

void BOARD_InitEcatCLKPins(void)
{
    IOMUXC_SetPinMux(IOMUXC_PAD_SD2_GPIO1__ECAT_CLK25, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH4_TXD2__ECAT_CLK25, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_SD2_GPIO1__ECAT_CLK25,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(3));     
    IOMUXC_SetPinConfig(IOMUXC_PAD_ETH4_TXD2__ECAT_CLK25,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_FSEL1(3));               

}

void BOARD_InitEcatI2CPins(void)
{

/* Using GPIO_IO14/GPIO_IO15 */
    // IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO14__ECAT_SDA, 0U);
    // IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO15__ECAT_SCL, 0U);
    // IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO14__ECAT_SDA,
    //                     IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_OD_MASK | IOMUXC_PAD_FSEL1(3));
    // IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO15__ECAT_SCL,
    //                     IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_OD_MASK | IOMUXC_PAD_FSEL1(3));

#if 1

    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO34__ECAT_SDA, 0U);
    IOMUXC_SetPinMux(IOMUXC_PAD_GPIO_IO35__ECAT_SCL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO34__ECAT_SDA,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_OD_MASK | IOMUXC_PAD_FSEL1(3));
    IOMUXC_SetPinConfig(IOMUXC_PAD_GPIO_IO35__ECAT_SCL,
                        IOMUXC_PAD_DSE(15U) | IOMUXC_PAD_OD_MASK | IOMUXC_PAD_FSEL1(3));
#endif
}

#ifdef ECAT_RMII_PORT
void BOARD_InitEcatPortRmiiPins(void)
{
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TXD0__ECAT_PT1_TXD0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TXD1__ECAT_PT1_TXD1, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TX_EN__ECAT_PT1_TX_EN, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TX_CLK__ECAT_PT1_TX_CLK, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RXD0__ECAT_PT1_RXD0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RXD1__ECAT_PT1_RXD1, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RX_DV__ECAT_PT1_RX_DV, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RX_ER__ECAT_PT1_RX_ER, 0);

    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TXD0__ECAT_PT0_TXD0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TXD1__ECAT_PT0_TXD1, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TX_EN__ECAT_PT0_TX_EN, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TX_CLK__ECAT_PT0_TX_CLK, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RXD0__ECAT_PT0_RXD0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RXD1__ECAT_PT0_RXD1, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RX_DV__ECAT_PT0_RX_DV, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RX_ER__ECAT_PT0_RX_ER, 0);
}
#else
void BOARD_InitEcatPortMiiPins(void)
{
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TXD0__ECAT_PT1_TXD0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TXD1__ECAT_PT1_TXD1, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TXD2__ECAT_PT1_TXD2, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TXD3__ECAT_PT1_TXD3, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TX_EN__ECAT_PT1_TX_EN, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_TX_CLK__ECAT_PT1_TX_CLK, 0);

    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RXD0__ECAT_PT1_RXD0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RXD1__ECAT_PT1_RXD1, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RXD2__ECAT_PT1_RXD2, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RXD3__ECAT_PT1_RXD3, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RX_DV__ECAT_PT1_RX_DV, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RX_ER__ECAT_PT1_RX_ER, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH1_RX_CLK__ECAT_PT1_RX_CLK,0);

    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TXD0__ECAT_PT0_TXD0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TXD1__ECAT_PT0_TXD1, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TXD2__ECAT_PT0_TXD2, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TXD3__ECAT_PT0_TXD3, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TX_EN__ECAT_PT0_TX_EN, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_TX_CLK__ECAT_PT0_TX_CLK, 0);

    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RXD0__ECAT_PT0_RXD0, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RXD1__ECAT_PT0_RXD1, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RXD2__ECAT_PT0_RXD2, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RXD3__ECAT_PT0_RXD3, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RX_DV__ECAT_PT0_RX_DV, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RX_ER__ECAT_PT0_RX_ER, 0);
    IOMUXC_SetPinMux(IOMUXC_PAD_ETH0_RX_CLK__ECAT_PT0_RX_CLK,0);
}

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) 
{
    BOARD_InitDebugConsolePins();
	BOARD_InitEcatLinkPins();
#ifdef ECAT_RMII_PORT
	BOARD_InitEcatPortRmiiPins();
#else
	BOARD_InitEcatPortMiiPins();
#endif
	BOARD_InitEcatI2CPins();
	BOARD_InitEcatMDIOPins();
    BOARD_InitEcatCLKPins();
    BOARD_InitEcatResetPins();
    BOARD_InitI2C6Pins();
    BOARD_InitGPIOPins();	
}

#endif

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
